#!/usr/bin/env python3
# -*- coding: utf-8 -*-
# Дана строка, в которой есть слово или. Определить, сколько раз оно встречается.
string1 = input("Введите строку")
print( string1.count('или'))